app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "aaaa"], ["user_id", 2], ["created_at", "2018-03-10 06:58:10.392371"], ["updated_at", "2018-03-10 06:58:10.392371"]]
---
	def create
		@task = current_user.tasks.build(task_params)
		if @task.save

UPDATE "tasks" SET "content" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["content", "dede"], ["updated_at", "2018-03-12 13:51:13.703003"], ["id", 305]]
---
	def update
		if @task.update_attributes(task_params)