app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		@task = @user.tasks.build
		@tasks = @user.tasks.desc.page(params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."user_id" = $2 ORDER BY "tasks"."created_at" DESC LIMIT $3  [["user_id", 4], ["user_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 4]]